Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_P405/eeprom_sim.c
/************************************************************************************//**
* \file         eeprom_sim.c
* \brief        Simulated EEPROM driver source file.
* \internal
*----------------------------------------------------------------------------------------
*                          C O P Y R I G H T
*----------------------------------------------------------------------------------------
*  Copyright 2019 (c)  by HAN Automotive   http://www.han.nl        All rights reserved
*
*----------------------------------------------------------------------------------------
*                            L I C E N S E
*----------------------------------------------------------------------------------------
* Permission is hereby granted, free of charge, to any person obtaining a copy of this 
* software and associated documentation files (the "Software"), to deal in the Software
* without restriction, including without limitation the rights to use, copy, modify, merge,
* publish, distribute, sublicense, and/or sell copies of the Software, and to permit
* persons to whom the Software is furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included in all copies or
* substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR
* PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE
* FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR
* OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
* DEALINGS IN THE SOFTWARE.
* \endinternal
****************************************************************************************/

/****************************************************************************************
* Include files
****************************************************************************************/
#include "eeprom_sim.h"                               /* simulated EEPROM  driver      */
#include "os.h"                                       /* for operating system          */
#include "stm32f4xx.h"                                /* STM32 registers               */
#include "stm32f4xx_conf.h"                           /* STM32 peripheral drivers      */


/****************************************************************************************
* Macro definitions
****************************************************************************************/
/** \brief The simulated EEPROM is mapped to flash. This macro defines its start address
 *         in flash.
 */
#define EEPROMSIM_FLASH_BASE_ADDRESS   (0x08008000)

/** \brief The total size of the simulated EEPROM in bytes. */
#define EEPROMSIM_TOTAL_SIZE           (2048)

/** \brief Flash page size. This is also the minimal erase size. Note that this is
 *         hardware defined and more than the actual simulated EEPROM size so the
 *         simulated EEPROM size can still grow in the future.
 */
#define EEPROMSIM_FLASH_PAGE_SIZE     (0x4000)

/** \brief Number of the flash page. */
#define EEPROMSIM_FLASH_PAGE_NUM     (FLASH_Sector_2)


/****************************************************************************************
* Local data declarations
****************************************************************************************/
static uint8_t eeprom_overlay_buffer[EEPROMSIM_TOTAL_SIZE];
static uint8_t eeprom_out_of_sync;


/************************************************************************************//**
** \brief     Initializes the simulated EEPROM driver.
** \return    none.
**
****************************************************************************************/
void EepromSimInit(void)
{
  uint8_t *src, *dst;
  uint16_t cnt;

  /* set source and destination pointers */
  src = (uint8_t *)EEPROMSIM_FLASH_BASE_ADDRESS;
  dst = (uint8_t *)&eeprom_overlay_buffer[0];
  /* copy flash EEPROM contents to RAM */
  for (cnt=0; cnt<EEPROMSIM_TOTAL_SIZE; cnt++)
  {
    *dst = *src;
    dst++;
    src++;
  }
  /* RAM and flash EEPROM are now synchronized */
  eeprom_out_of_sync = FALSE;
} /*** end of EepromSimInit ***/


/************************************************************************************//**
** \brief     Synchronized the values in the RAM buffer to flash memory. During read,
**            write and erase operations the data is only updated in the RAM buffer.
**            These changes will be lost upon power off. At one point in time, ideally
**            before power off, the changes should be stored in flash memory. This is
**            achieved by calling this function.
** \return    none.
**
****************************************************************************************/
void EepromSimSynchronize(void)
{
  uint16_t  wordCnt;
  uint32_t programBaseAddr;
  uint32_t *programDataPtr;
  uint32_t saved_cs_state;

  /* check if there is a difference between RAM and flash EEPROM */
  if (eeprom_out_of_sync == FALSE)
  {
    /* no need to update the flash sector */
    return;
  }

  /* enter critical section to make sure flash operation is not interrupted */
  saved_cs_state = OsEnterCriticalSection();
  /* unlock the flash array */
  FLASH_Unlock();
  /* clear pending flags (if any) */
  FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR |
                  FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR|FLASH_FLAG_PGSERR);
  /* submit the sector erase request */
  FLASH_EraseSector(EEPROMSIM_FLASH_PAGE_NUM, VoltageRange_3);
  /* clear pending flags (if any) */
  FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR |
                  FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR|FLASH_FLAG_PGSERR);

  /* determine base address */
  programBaseAddr = EEPROMSIM_FLASH_BASE_ADDRESS;

  /* program the data word-by-word */
  for (wordCnt=0; wordCnt<(EEPROMSIM_TOTAL_SIZE/sizeof(uint32_t)); wordCnt++)
  {
    programDataPtr = (uint32_t *)(&eeprom_overlay_buffer[wordCnt*sizeof(uint32_t)]);
    FLASH_ProgramWord(programBaseAddr, *programDataPtr);
    programBaseAddr += sizeof(uint32_t);
  }
  /* lock the flash array again */
  FLASH_Lock();

  /* leave critical section */
  OsLeaveCriticalSection(saved_cs_state);

  /* RAM and flash EEPROM are now synchronized */
  eeprom_out_of_sync = FALSE;
} /*** end of EepromSimSynchronize ***/


/************************************************************************************//**
** \brief     Erases the simulated EEPROM by setting all values in the RAM buffer to
**            0xff, which is the default value of an erased EEPROM byte. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \return    none.
**
****************************************************************************************/
void EepromSimBulkErase(void)
{
  uint16_t cnt;

  /* sets all bytes to the default EEPROM erased value */
  for (cnt=0; cnt<EEPROMSIM_TOTAL_SIZE; cnt++)
  {
    /* keep track of dirty flag */
    if (eeprom_overlay_buffer[cnt] != 0xff)
    {
      eeprom_overlay_buffer[cnt] = 0xff;
      /* RAM buffer and flash are now out of sync */
      eeprom_out_of_sync = TRUE;
    }
  }
} /*** end of EepromSimBulkErase ***/


/************************************************************************************//**
** \brief     Obtains a pointer to the EEPROM data at the specified address.
** \param     address Memory address to get the pointer from
** \return    The requested pointer if successfull, otherwise NULL.
**
****************************************************************************************/
uint8_t *EepromSimGetPtr(uint16_t address)
{
    /* check the address */
  if (address >= EEPROMSIM_TOTAL_SIZE)
  {
    /* invalid address, cannot continue */
    return NULL;
  }
  return &eeprom_overlay_buffer[address];
} /*** end of EepromSimGetPtr ***/


/************************************************************************************//**
** \brief     Erases a part of the simulated EEPROM by setting the values in the RAM
**            buffer to 0xff, which is the default value of an erased EEPROM byte. Use
**            function EepromSimSynchronize to actually process the changes in
**            non-volatile flash.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     len Number of bytes to erase.
** \return    none.
**
****************************************************************************************/
void EepromSimErase(uint16_t address, uint16_t len)
{
  uint16_t idx;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - len) + 1)
  {
    /* invalid address, cannot continue */
    return;
  }

