Teuskamerling/FMStwizy/blockset/rtw/STM32/src/STM32_P405/eeprom_sim.c
  /* sets bytes in memory range to the default EEPROM erased value */
  for (idx=address; idx<(address+len); idx++)
  {
    /* keep track of dirty flag */
    if (eeprom_overlay_buffer[idx] != 0xff)
    {
      eeprom_overlay_buffer[idx] = 0xff;
      /* RAM buffer and flash are now out of sync */
      eeprom_out_of_sync = TRUE;
    }
  }
} /*** end of EepromSimErase ***/


/************************************************************************************//**
** \brief     Reads an unsigned 8-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
uint8_t EepromSimUINT8Get(uint16_t address)
{
  uint8_t  data_val = 0;
  uint8_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint8_t)) + 1)
  {
	  /* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to read */
  data_val_ptr = (uint8_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimUINT8Get ***/


/************************************************************************************//**
** \brief     Reads a signed 8-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
int8_t EepromSimSINT8Get(uint16_t address)
{
  int8_t  data_val = 0;
  int8_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int8_t)) + 1)
  {
	/* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to read */
  data_val_ptr = (int8_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimSINT8Get ***/


/************************************************************************************//**
** \brief     Reads an unsigned 16-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
uint16_t EepromSimUINT16Get(uint16_t address)
{
  uint16_t  data_val = 0;
  uint16_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint16_t)) + 1)
  {
	/* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
    /* determine the pointer of the data to read */
  data_val_ptr = (uint16_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimUINT16Get ***/


/************************************************************************************//**
** \brief     Reads a signed 16-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
int16_t EepromSimSINT16Get(uint16_t address)
{
  int16_t  data_val = 0;
  int16_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int16_t)) + 1)
  {
	/* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to read */
  data_val_ptr = (int16_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimSINT16Get ***/


/************************************************************************************//**
** \brief     Reads an unsigned 32-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
uint32_t EepromSimUINT32Get(uint16_t address)
{
  uint32_t  data_val = 0;
  uint32_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint32_t)) + 1)
  {
	/* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to read */
  data_val_ptr = (uint32_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimUINT32Get ***/


/************************************************************************************//**
** \brief     Reads a signed 32-bit value from the specified virtual memory address.
** \param     address Memory pointer to read from. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \return    the value read from the memory address.
**
****************************************************************************************/
int32_t EepromSimSINT32Get(uint16_t address)
{
  int32_t  data_val = 0;
  int32_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int32_t)) + 1)
  {
	/* invalid address, return a dummy value */
    return data_val;
  }
  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to read */
  data_val_ptr = (int32_t*)(&eeprom_overlay_buffer[address]);
  /* read the value from the RAM buffer */
  data_val = *data_val_ptr;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* return the results */
  return data_val;
} /*** end of EepromSimSINT32Get ***/


/************************************************************************************//**
** \brief     Writes an unsigned 8-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimUINT8Set(uint16_t address, uint8_t value)
{
  uint8_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint8_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimUINT8Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (uint8_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimUINT8Set ***/


/************************************************************************************//**
** \brief     Writes an signed 8-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimSINT8Set(uint16_t address, int8_t value)
{
  int8_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int8_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimSINT8Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (int8_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimSINT8Set ***/


/************************************************************************************//**
** \brief     Writes an unsigned 16-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimUINT16Set(uint16_t address, uint16_t value)
{
  uint16_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint16_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimUINT16Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (uint16_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimUINT16Set ***/


/************************************************************************************//**
** \brief     Writes an signed 16-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimSINT16Set(uint16_t address, int16_t value)
{
  int16_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int16_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimSINT16Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (int16_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimSINT16Set ***/


/************************************************************************************//**
** \brief     Writes an unsigned 32-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimUINT32Set(uint16_t address, uint32_t value)
{
  uint32_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(uint32_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimUINT32Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (uint32_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimUINT32Set ***/


/************************************************************************************//**
** \brief     Writes an signed 32-bit value to the specified memory address. Use function
**            EepromSimSynchronize to actually process the changes in non-volatile flash.
** \param     address Memory pointer to write to. Must be a valid value in the range
**                    0 and EEPROMSIM_TOTAL_SIZE.
** \param     value Value to write to the memory address.
** \return    none.
**
****************************************************************************************/
void EepromSimSINT32Set(uint16_t address, int32_t value)
{
  int32_t *data_val_ptr;
  uint32_t saved_cs_state;

  /* check the address */
  if (address >= (EEPROMSIM_TOTAL_SIZE - sizeof(int32_t)) + 1)
  {
	/* cannot continue because the address in invalid */
	return;
  }

  /* only continue if the same value is not already there */
  if (EepromSimSINT32Get(address) == value)
  {
    /* already done */
    return;
  }

  /* start critical section */
  saved_cs_state = OsEnterCriticalSection();
  /* determine the pointer of the data to write */
  data_val_ptr = (int32_t*)(&eeprom_overlay_buffer[address]);
  /* write the data */
  *data_val_ptr = value;
  /* end critical section */
  OsLeaveCriticalSection(saved_cs_state);
  /* set flag that RAM and flash EEPROM are now out of sync */
  eeprom_out_of_sync = TRUE;
} /*** end of EepromSimSINT32Set ***/


/************************************ end of eeprom_sim.c ******************************/


